# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'git-flow'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts


# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'flipper' # mobile app debugging
brew 'gdal'
brew 'imagemagick'
brew 'java'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew  'openssl readline sqlite3 xz zlib' # python build dependencies
brew 'pipx' # python package + virtual env manager
brew 'anaconda' # anaconda python UI
brew 'kubectl'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'pv'
brew 'redis'
brew 'tree'
brew 'yarn'

# libpostal (postal code parser) dependencies
brew 'curl'
brew 'autoconf'
brew 'automake'
brew 'libtool'
brew 'pkg-config'

# Apps
cask 'brewservicesmenubar'
cask 'daisydisk'
cask 'dbeaver'
cask 'pgadmin4'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'flux'
cask 'gimp'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'        # One simple package with everything you need, to protect your emails and files.
cask 'helo'             # Painless local email testing for web developers.
cask 'imageoptim'       # makes images load faster
cask 'inkscape'
cask 'insomnia'         # Build APIs that work
cask 'iterm2'
cask 'fig'
cask 'malwarebytes'
cask 'meld'
cask 'mendeley'
cask 'monitorcontrol'
cask 'mysqlworkbench'
cask 'notion'
cask 'open-in-code'
cask 'openrefine'
cask 'pastebot'
cask 'postman'
cask 'postico'
cask 'protege'
cask 'react-native-debugger'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'xquartz'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825