# Taps
tap "aws/tap"
tap "dafuqtor/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

# Binaries
brew "libyaml"
brew "ansible"
brew "ansible-lint"
brew "autoconf"
brew "automake"
brew "awscli"
brew "awslogs"
brew "bash-completion"
brew "bfg"
brew "glib"
brew "certbot"
brew "consul", restart_service: true
brew "coreutils"
brew "cowsay"
brew "openldap"
brew "curl"
brew "docker-compose"
brew "docker-machine", restart_service: true
brew "exiftool"
brew "libtool"
brew "guile"
brew "unbound", restart_service: true
brew "gnutls"
brew "gobject-introspection"
brew "nghttp2"
brew "srt"
brew "ffmpeg"
brew "findutils"
brew "freetds"
brew "geckodriver"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "git-sizer"
brew "gnu-sed"
brew "libksba"
brew "gnupg"
brew "go"
brew "gopass"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "httpie"
brew "hyperkit"
brew "libheif"
brew "liblqr"
brew "imagemagick"
brew "mysql-client"
brew "innotop"
brew "jo"
brew "jq"
brew "krb5"
brew "libpq"
brew "nmap"
brew "node"
brew "nvm"
brew "pinentry-mac"
brew "plantuml"
brew "poetry"
brew "pv"
brew "pyenv"
brew "rename"
brew "rsync"
brew "thefuck"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "aws/tap/aws-sam-cli"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-database-tools"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-community-shell"

# Apps
cask "adobe-acrobat-reader"
cask "bitwarden"
cask "brave-browser"
cask "chromedriver"
cask "docker"
cask "firefox"
cask "google-chat"
cask "google-chrome"
cask "gpg-suite"
cask "intellij-idea-ce"
cask "iterm2"
cask "itsycal"
cask "keka"
cask "licecap"
cask "macpass"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "midclick"
cask "mysql-utilities"
cask "mysqlworkbench"
cask "postman"
cask "powershell"
cask "pycharm-ce"
cask "rectangle"
cask "robo-3t"
cask "sequel-pro"
cask "slack"
cask "spotify"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
