# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'
tap 'caskroom/fonts'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'vim'
brew 'nmap'
brew 'prettier'

# Apps
cask '1password'
cask 'anydesk'
cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'carbon-copy-cloner'
cask 'cleanmymac'
cask 'cyberghost-vpn'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'forklift'
cask 'github'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hazel'
cask 'helo'
cask 'imageoptim'
cask 'iterm2'
cask 'insomnia'
cask 'jetbrains-toolbox'
cask 'microsoft-excel'
cask 'openaudible'
cask 'obsidian'
cask 'pastebot'
cask 'rapidapi'
cask 'phpmon'
cask 'prusaslicer'
cask 'ray'
#cask 'readdle-spark'
cask 'screenflow'
cask 'slack'
cask 'steam'
cask 'signal'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
cask 'zwift'

cask 'arq'
cask 'vivaldi'
cask 'plex-htpc'
cask 'ledger-live'
cask 'tor-browser'
cask 'brave-browser'
cask 'calendar-366'
cask 'istat-menus'
cask 'mimestream'
cask 'sketch'
cask 'pdf-expert'
cask 'keyboard-maestro'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984

mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005

mas 'Daily', id: 686910553
mas 'Tot', id: 1491071483
mas 'Day One', id: 1055511498
mas 'Developer', id: 640199958

mas 'Jump Desktop', id: 524141863
mas 'Magnet', id: 441258766
mas 'CodeRunner', id: 955297617
mas 'MindNode', id: 1289197285
mas 'Xcode', id: 497799835
mas 'PDFScanner', id: 410968114
mas 'SnippetsLab', id: 1006087419
mas 'inShort', id: 856124300
mas 'Gemini 2', id: 1090488118
mas 'ColorSlurp', id: 1287239339

mas 'Affinity Designer 2', id: 1616831348
mas 'Affinity Publisher 2', id: 1606941598
mas 'Affinity Photo 2', id: 1616822987
mas 'Darkroom', id: 953286746
mas 'Shapr3D', id: 1091675654

mas '1Password for Safari', id: 1569813296
mas 'Darkreader for Safari', id: 1438243180
mas 'Hush', id: 1544743900

mas 'Audiobook Builder', id: 1437681957
mas 'Yomu', id: 562211012
mas 'Kindle', id: 405399194
mas 'GoodNotes', id: 1444383602
